

print("**** 1번 문제 ****")
print("500 + 500")
print("%d" % (500 + 500))
# print("%d" % (500, 600))
# print("%d %d" % (700))
print("정답 : 1, 2 ")


print("\n**** 2번 문제 ****")
print("%d / %d = %d" % (10, 4, 10/4))
print("%d / %d = %f" % (10, 4, 10/4))
print("%d / %d = %5.1f" % (10, 4, 10/4))
print("%d / %d = %5.0f" % (10, 4, 10/4))


print("\n**** 3번 문제 ****")
print("%05d" % 543)
print("%10s" % "파이썬")
print("%7.1f" % 123.45)


print("\n**** 4번 문제 ****")
print("정답 : 1, 4 ")
print("1번은 탭을 누른 효과를 주지 않는다.")
print("4번은 삐 소리를 내는건 \\a다.")


print("\n**** 5번 문제 ****")
print("정답 : 1, 3, 4")
print("1번은 변수 선언은 꼭 필요하다")
print("3번은 변수에 변수를 대입할 수 있다")
print("type()함수는 타입값을 알려주는 역할이다.")


print("\n**** 6번 문제 ****")
print("10이라는 정수 값에 c라는 변수를 대입할 수 없다. 정수는 변수가 아니기 때문이다.")


print("\n**** 7번 문제 ****")
print(int('0b0011', 2))
print(int('0b01010', 2))
print(int('0x11', 16))
print(int('0o17', 8))


print("\n**** 8번 문제 ****")
# print(int('1002', 2))
# print(int('1008', 8))
# print(int('AAFG', 16))
print("2진수는 0, 1만 사용할 수 있다. 변수에서 2는 사용할 수 없다")
print("8진수는 0 ~ 7까지만 사용할 수 있다. 변수에서 8은 사용할 수 없다")
print("16진수는 0 ~ F만 사용할 수 있다. 변수에서 G는 사용할 수 없다")


print("\n**** 9번 문제 ****")
print(bin(12))
print(hex(12))
print(oct(12))